<a href="https://colab.research.google.com/github/18cse169/aman18cse169/blob/main/Assignment_2_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
import numpy as np

In [2]:
data=[6,4,8,2,7]
df=pd.DataFrame(data)
df

   0
0  6
1  4
2  8
3  2
4  7

In [3]:
data=[['John',14],['Stuart',22],['Max',18]]
df=pd.DataFrame(data)
df

        0   1
0    John  14
1  Stuart  22
2     Max  18

In [6]:
s = pd.Series([9, 7, 5, np.nan, 4, 2])
s

0    9.0
1    7.0
2    5.0
3    NaN
4    4.0
5    2.0
dtype: float64

In [8]:
dates = pd.date_range('20031201', periods=4)
dates

DatetimeIndex(['2003-12-01', '2003-12-02', '2003-12-03', '2003-12-04'], dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(4, 4), index=dates, columns=list('QWER'))
df

                   Q         W         E         R
2003-12-01  0.104535  0.966132 -0.600014  1.082210
2003-12-02 -0.439610 -0.768728  1.239604 -0.963182
2003-12-03 -0.800291  0.389351  0.148718 -0.706651
2003-12-04  0.419596 -0.434904  0.054481 -0.542935

In [14]:
df2 = pd.DataFrame({'Q': 8.,'W': pd.Timestamp('20031201'),'E': pd.Series(1, index=list(range(4)), dtype='float32'),'R': np.array([3] * 4, dtype='int32'),'E': pd.Categorical(["RUN", "STOP", "RUN", "STOP"]),'F': 'Pass'})
df2

     Q          W     E  R     F
0  8.0 2003-12-01   RUN  3  Pass
1  8.0 2003-12-01  STOP  3  Pass
2  8.0 2003-12-01   RUN  3  Pass
3  8.0 2003-12-01  STOP  3  Pass

In [15]:
df.head()

                   Q         W         E         R
2003-12-01  0.104535  0.966132 -0.600014  1.082210
2003-12-02 -0.439610 -0.768728  1.239604 -0.963182
2003-12-03 -0.800291  0.389351  0.148718 -0.706651
2003-12-04  0.419596 -0.434904  0.054481 -0.542935

In [16]:
df.tail(3)

                   Q         W         E         R
2003-12-02 -0.439610 -0.768728  1.239604 -0.963182
2003-12-03 -0.800291  0.389351  0.148718 -0.706651
2003-12-04  0.419596 -0.434904  0.054481 -0.542935

In [17]:
df.index

DatetimeIndex(['2003-12-01', '2003-12-02', '2003-12-03', '2003-12-04'], dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['Q', 'W', 'E', 'R'], dtype='object')

In [19]:
df.to_numpy()

array([[ 0.10453541,  0.96613205, -0.6000136 ,  1.08220953],
       [-0.43960951, -0.76872846,  1.2396043 , -0.96318188],
       [-0.80029135,  0.38935104,  0.14871783, -0.70665052],
       [ 0.41959587, -0.43490404,  0.05448139, -0.54293473]])

In [20]:
df2.to_numpy()

array([[8.0, Timestamp('2003-12-01 00:00:00'), 'RUN', 3, 'Pass'],
       [8.0, Timestamp('2003-12-01 00:00:00'), 'STOP', 3, 'Pass'],
       [8.0, Timestamp('2003-12-01 00:00:00'), 'RUN', 3, 'Pass'],
       [8.0, Timestamp('2003-12-01 00:00:00'), 'STOP', 3, 'Pass']],
      dtype=object)

In [21]:
df2.describe()

         Q    R
count  4.0  4.0
mean   8.0  3.0
std    0.0  0.0
min    8.0  3.0
25%    8.0  3.0
50%    8.0  3.0
75%    8.0  3.0
max    8.0  3.0

In [22]:
df.describe()

              Q         W         E         R
count  4.000000  4.000000  4.000000  4.000000
mean  -0.178942  0.037963  0.210697 -0.282639
std    0.545475  0.787258  0.762484  0.926191
min   -0.800291 -0.768728 -0.600014 -0.963182
25%   -0.529780 -0.518360 -0.109142 -0.770783
50%   -0.167537 -0.022776  0.101600 -0.624793
75%    0.183301  0.533546  0.421439 -0.136649
max    0.419596  0.966132  1.239604  1.082210

In [23]:
df.T

   2003-12-01  2003-12-02  2003-12-03  2003-12-04
Q    0.104535   -0.439610   -0.800291    0.419596
W    0.966132   -0.768728    0.389351   -0.434904
E   -0.600014    1.239604    0.148718    0.054481
R    1.082210   -0.963182   -0.706651   -0.542935